IDEA StatiCa Open Model
CoordSystemByVector Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Coordinate system defined by vectors
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Geometry3D.CoordSystem
 IdeaRS.OpenModel.Geometry3D.CoordSystemByVector
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class CoordSystemByVector : CoordSystem
Public Class CoordSystemByVector
	Inherits CoordSystem
public ref class CoordSystemByVector : public CoordSystem
The CoordSystemByVector type exposes the following members.
Constructors
Name | Description
CoordSystemByVector
Initializes a new instance of the CoordSystemByVector class
Top
Properties
Name | Description
VecX
 Axis X unit vector
VecY
 Axis Y unit vector
VecZ
 Axis Z unit vector
Top
See Also
Reference
IdeaRS.OpenModel.Geometry3D Namespace